[{"Item model number": "K-3950-0", "Warranty Description": "One-year limited warranty", "International Shipping": "This item is not eligible for international shipping. Learn More", "5 star": "81%", "Item Dimensions": "—28.38 x 18.88 x 31.13 in—17.63 x 28.75 x 30.75 in28.38 x 18.88 x 31.5 in19.63 x 29.5 x 30.38 in", "1 star": "6%", "Amazon Music Stream millions of songs": "Amazon Drive Cloud storage from Amazon6pm Score deals on fashion brandsAbeBooks Books, art & collectiblesACX Audiobook Publishing Made EasyAlexa Actionable Analytics for the WebAmazon Business Everything For Your Business", "3 star": "3%", "Shipping Weight": "72.8 pounds", "Batteries Included?": "No", "This item KOHLER K-3950-0 Tresham Comfort Height Two-Piece Elongated 1.28 GPF Toilet with AquaPiston Flush Technology and Left-Hand Trip Lever, White": "Kohler K-3933-0 Memoirs Comfort Height Two-Piece Round Front Toilet with Stately Design, WhiteKOHLER K-3817-0 Memoirs Stately Comfort Height Two-Piece Elongated 1.28 GPF Toilet with AquaPiston Flush Technology and Left-Hand Trip Lever, WhiteCimarron Comfort Height Two-Piece Elongated 1.6 Gpf Toilet with AquaPiston Flush Technology and Left-Hand Trip Lever Finish: WhiteKohler K-3986-0 Memoirs Comfort Height Two-Piece Round Front Toilet with Classic Design, WhiteKohler K-3658-0 Highline Classic Class Five Comfort Height Toilet with Left-Hand Trip Lever, White", "Batteries Required?": "No", "Kindle Direct Publishing Indie Digital Publishing Made Easy": "Prime Now FREE 2-Hour Delivery on Everyday ItemsPrime Photos Unlimited Photo Storage Free With PrimeShopbop Designer Fashion BrandsTenMarks.com Math Activities for Kids & SchoolsAmazon Warehouse Great Deals on Quality Used ProductsWhole Foods Market America’s Healthiest Grocery Store", "2 star": "3%", "Best Sellers Rank": "#307,211 in Tools & Home Improvement ( See top 100 ) #136 in Tools & Home Improvement > Kitchen & Bath Fixtures > Bathroom Fixtures > Toilets & Toilet Parts > Toilets > Two-Piece Toilets", "Price": "From $387.15$379.00 $ 379 . 00$485.63 $ 485 . 63$299.99 $ 299 . 99$339.99 $ 339 . 99$258.58 $ 258 . 58", "AmazonFresh Groceries & More Right To Your Door": "AmazonGlobal Ship Orders InternationallyHome Services Handpicked Pros Happiness GuaranteeAmazon Inspire Digital Educational ResourcesAmazon Rapids Fun stories for kids on the goAmazon Restaurants Food delivery from local restaurantsAmazon Video Direct Video Distribution Made Easy", "Shape": "elongated", "Domestic Shipping": "Amazon only ships this item within the contiguous 48 United States. Other Sellers on Amazon may ship this item to Alaska, Hawaii and US Territories.", "Withoutabox Submit to Film Festivals": "Woot! Deals and ShenanigansZappos Shoes & ClothingSouq.com Shop Online in the Middle EastSubscribe with Amazon Discover & try subscription services", "Package Dimensions": "28.5 x 16.5 x 14.5 inches", "Included Components": "toilet", "Item Package Quantity": "1", "Date First Available": "May 21, 2011", "ASIN": "B005E3PQEI", "Add to Cart": "Add to CartAdd to CartAdd to CartAdd to Cart", "Sold By": "Available from these sellersNeed Plumbing SuppliesAF SupplyeFaucetseFaucetseFaucets", "Amazon Web Services Scalable Cloud Computing Services": "Audible Download Audio BooksAudiobookStand Discount Audiobooks on DiscBook Depository Books With Free Delivery WorldwideBox Office Mojo Find Movie Box Office DataComiXology Thousands of Digital ComicsCreateSpace Indie Print Publishing Made Easy", "Shipping": "—FREE ShippingFREE ShippingFREE ShippingFREE ShippingFREE Shipping", "Item Weight": "72.8 pounds", "Number of Handles": "1", "Customer Reviews": "4.0 out of 5 stars 31 customer reviews 4.0 out of 5 stars", "Part Number": "K-3950", "DPReview Digital Photography": "East Dane Designer Men's FashionFabric Sewing, Quilting & KnittingGoodreads Book reviews & recommendationsIMDb Movies, TV & CelebritiesIMDbPro Get Info Entertainment Professionals NeedJunglee.com Shop Online in India", "Certification": "Watersense", "Color": "White", "Customer Rating": "4 out of 5 stars (31)5 out of 5 stars (2)4 out of 5 stars (97)3 out of 5 stars (72)5 out of 5 stars (3)4 out of 5 stars (15)", "4 star": "7%", "Size": "Value not found", "Water Consumption": "1.28 GPF"}]