[{"Item model number": "539247", "Warranty Description": "1 Year Limited Warranty", "Material": "Metal", "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More", "5 star": "65%", "Item Dimensions": "8.13 x 3.2 x 1.97 in2.4 x 8.8 x 4.2 in2.4 x 8.8 x 3.6 in1.81 x 3.2 x 8.28 in1.5 x 9 x 2.7 in4 x 9 x 4.3 in", "1 star": "4%", "Amazon Music Stream millions of songs": "Amazon Drive Cloud storage from Amazon6pm Score deals on fashion brandsAbeBooks Books, art & collectiblesACX Audiobook Publishing Made EasyAlexa Actionable Analytics for the WebAmazon Business Everything For Your Business", "3 star": "9%", "Shipping Weight": "8 ounces ( View shipping rates and policies )", "This item Design House 539247 Millbridge Toilet Paper Holder, Oil Rubbed Bronze": "Delta Faucet GRG50-VBR Georgian Pivoting Toilet Paper Holder, SpotShield Venetian BronzePeerless  LKW50-VBR Lockhart Toilet Paper Holder, Venetian BronzeHardware House 689521 Sunset Collection Toilet Paper Holder, Classic BronzeELLO&ALLO Oil Rubbed Bronze Toilet Paper Holder Bathroom Accessories Wall-Mounted , Rust ProtectionInterDesign Orbinni Toilet Paper Holder – Wall Mounted Roll Dispenser for Bathroom, Bronze", "ASIN": "B000WLA7A0", "Batteries Required?": "No", "Kindle Direct Publishing Indie Digital Publishing Made Easy": "Prime Now FREE 2-Hour Delivery on Everyday ItemsPrime Photos Unlimited Photo Storage Free With PrimeShopbop Designer Fashion BrandsTenMarks.com Math Activities for Kids & SchoolsAmazon Warehouse Great Deals on Quality Used ProductsWhole Foods Market America’s Healthiest Grocery Store", "2 star": "2%", "Best Sellers Rank": "#21,380 in Tools & Home Improvement ( See top 100 ) #129 in Tools & Home Improvement > Hardware > Bathroom Hardware > Toilet Paper Holders #459 in Tools & Home Improvement > Kitchen & Bath Fixtures > Bathroom Fixtures > Bathroom Hardware & Installation", "Price": "$11.32 $ 11 . 32$12.11 $ 12 . 11$11.75 $ 11 . 75$5.88 $ 5 . 88$15.99 $ 15 . 99$11.33 $ 11 . 33", "AmazonFresh Groceries & More Right To Your Door": "AmazonGlobal Ship Orders InternationallyHome Services Handpicked Pros Happiness GuaranteeAmazon Inspire Digital Educational ResourcesAmazon Rapids Fun stories for kids on the goAmazon Restaurants Food delivery from local restaurantsAmazon Video Direct Video Distribution Made Easy", "Domestic Shipping": "Item can be shipped within U.S.", "Withoutabox Submit to Film Festivals": "Woot! Deals and ShenanigansZappos Shoes & ClothingSouq.com Shop Online in the Middle EastSubscribe with Amazon Discover & try subscription services", "Item Package Quantity": "1", "Date First Available": "February 8, 2010", "Add to Cart": "Add to CartAdd to CartAdd to CartAdd to CartAdd to Cart", "Sold By": "Amazon.comAmazon.comMad About DealsAmazon.comELLO&ALLOAmazon.com", "Amazon Web Services Scalable Cloud Computing Services": "Audible Download Audio BooksAudiobookStand Discount Audiobooks on DiscBook Depository Books With Free Delivery WorldwideBox Office Mojo Find Movie Box Office DataComiXology Thousands of Digital ComicsCreateSpace Indie Print Publishing Made Easy", "Shipping": "FREE ShippingFREE ShippingFREE ShippingFREE ShippingFREE ShippingFREE Shipping", "Item Weight": "1.6 pounds", "Finish": "Chrome", "Customer Reviews": "4.3 out of 5 stars 161 customer reviews 4.3 out of 5 stars", "Part Number": "539247", "DPReview Digital Photography": "East Dane Designer Men's FashionFabric Sewing, Quilting & KnittingGoodreads Book reviews & recommendationsIMDb Movies, TV & CelebritiesIMDbPro Get Info Entertainment Professionals NeedJunglee.com Shop Online in India", "Color": "Oil-Rubbed Bronze", "Customer Rating": "4 out of 5 stars (161)4 out of 5 stars (92)4 out of 5 stars (87)4 out of 5 stars (33)4 out of 5 stars (92)5 out of 5 stars (157)", "4 star": "20%", "Product Dimensions": "3.2 x 8.1 x 2 inches"}]