[{"Return Policy": "This product is non-returnable and non-refundable.", "OS:": "Windows Me/2000/XP/Vista/7", "5 star": "29%", "RAM:": "16 MB", "Countries": "Note: Currently, this item is available only to customers located in the United States.", "1 star": "57%", "Amazon Music Stream millions of songs": "Amazon Drive Cloud storage from Amazon6pm Score deals on fashion brandsAbeBooks Books, art & collectiblesACX Audiobook Publishing Made EasyAlexa Actionable Analytics for the WebAmazon Business Everything For Your Business", "3 star": "14%", "4 star 4 star (0%)": "0%", "Additional Info:": "Unknown", "2 star 2 star (0%)": "0%", "Release date": "December 7, 2012", "Customer Reviews": "2.8 out of 5 stars 7 customer reviews 2.8 out of 5 stars", "ASIN": "B00AHH57YA", "Kindle Direct Publishing Indie Digital Publishing Made Easy": "Prime Now FREE 2-Hour Delivery on Everyday ItemsPrime Photos Unlimited Photo Storage Free With PrimeShopbop Designer Fashion BrandsTenMarks.com Math Activities for Kids & SchoolsAmazon Warehouse Great Deals on Quality Used ProductsWhole Foods Market America’s Healthiest Grocery Store", "DPReview Digital Photography": "East Dane Designer Men's FashionFabric Sewing, Quilting & KnittingGoodreads Book reviews & recommendationsIMDb Movies, TV & CelebritiesIMDbPro Get Info Entertainment Professionals NeedJunglee.com Shop Online in India", "Best Sellers Rank": "#76,168 in Video Games ( See Top 100 in Video Games ) #4,793 in Video Games > PC Games > Digital Games & DLC #8,046 in Video Games > Digital Games #11,731 in Video Games > PC Games > PC Games", "AmazonFresh Groceries & More Right To Your Door": "AmazonGlobal Ship Orders InternationallyHome Services Handpicked Pros Happiness GuaranteeAmazon Inspire Digital Educational ResourcesAmazon Rapids Fun stories for kids on the goAmazon Restaurants Food delivery from local restaurantsAmazon Video Direct Video Distribution Made Easy", "Hard Drive:": "25 MB", "Processor:": "Pentium 100 MHz", "Amazon Web Services Scalable Cloud Computing Services": "Audible Download Audio BooksAudiobookStand Discount Audiobooks on DiscBook Depository Books With Free Delivery WorldwideBox Office Mojo Find Movie Box Office DataComiXology Thousands of Digital ComicsCreateSpace Indie Print Publishing Made Easy", "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.", "Terms of Use": "By placing your order, you agree to our Terms of Use .", "Video Card:": "DirectX 7.0 or higher", "Withoutabox Submit to Film Festivals": "Woot! Deals and ShenanigansZappos Shoes & ClothingSouq.com Shop Online in the Middle EastSubscribe with Amazon Discover & try subscription services"}]