[{"3 star": "10%", "Number of Items": "12418011", "AmazonFresh Groceries & More Right To Your Door": "AmazonGlobal Ship Orders InternationallyHome Services Handpicked Pros Happiness GuaranteeAmazon Inspire Digital Educational ResourcesAmazon Rapids Fun stories for kids on the goAmazon Restaurants Food delivery from local restaurantsAmazon Video Direct Video Distribution Made Easy", "Add to Cart": "Add to CartAdd to CartAdd to CartAdd to Cart", "Sold By": "—Amazon.comAmazon.comAmazon.comAmazon.comAmazon.com", "Amazon Web Services Scalable Cloud Computing Services": "Audible Download Audio BooksAudiobookStand Discount Audiobooks on DiscBook Depository Books With Free Delivery WorldwideBox Office Mojo Find Movie Box Office DataComiXology Thousands of Digital ComicsCreateSpace Indie Print Publishing Made Easy", "Shipping": "—FREE ShippingFREE ShippingFREE ShippingFREE ShippingFREE Shipping", "Charmin Ultra Soft toilet paper gives you and your family more softness and 75% more absorbency while still letting you use up to 4X less than the leading bargain brand.": "Charmin Ultra Strong toilet paper cleans better and you can use up to 4X less than the leading bargain brand.Charmin Sensitive is our only toilet paper with soothing and gentle lotion with a touch of Aloe and E. And it's dermatologist tested to be gentle on skin.Charmin Basic toilet paper is softer and 3X stronger* (when wet) for an incredible price (*vs. the leading bargain brand.)Use Charmin Freshmates flushable wet wipes along with your favorite kind of Charmin bath tissue for a cleaner clean than dry tissue alone.", "5 star": "54%", "Kindle Direct Publishing Indie Digital Publishing Made Easy": "Prime Now FREE 2-Hour Delivery on Everyday ItemsPrime Photos Unlimited Photo Storage Free With PrimeShopbop Designer Fashion BrandsTenMarks.com Math Activities for Kids & SchoolsAmazon Warehouse Great Deals on Quality Used ProductsWhole Foods Market America’s Healthiest Grocery Store", "DPReview Digital Photography": "East Dane Designer Men's FashionFabric Sewing, Quilting & KnittingGoodreads Book reviews & recommendationsIMDb Movies, TV & CelebritiesIMDbPro Get Info Entertainment Professionals NeedJunglee.com Shop Online in India", "2 star": "8%", "Price": "Unavailable$21.58 $ 21 . 58$27.40 $ 27 . 40$48.20 $ 48 . 20$21.99 $ 21 . 99$28.99 $ 28 . 99", "Item Dimensions": "8.94 x 21.88 x 16.38 in15.9 x 10.2 x 16.4 in16.6 x 16.6 x 16.4 in19.12 x 23.75 x 17 in9 x 13.25 x 8 in12.4 x 16.6 x 16.4 in", "This item Charmin Ultra Strong Toilet Paper 40 Double Roll (10 Packs of 4 Double Rolls)": "Charmin Ultra Strong Toilet Paper, Mega Roll, 24 Count (Packaging May Vary) #1 Best SellerCharmin Ultra Strong Toilet Paper, Bath Tissue, Double Roll, 48 Count ( Pack May Vary )Georgia Pacific Professional 1988001 Bathroom Tissue, 550 Sheets Per Roll (Case of 80 rolls)Angel Soft 2 Ply Toilet Paper, 48 Double Bath Tissue (Pack of 4 with 12 rolls each) #1 Best SellerCharmin Ultra Soft Double Roll Toilet Paper, 48 Count", "Customer Rating": "4 out of 5 stars (443)4 out of 5 stars (1460)3 out of 5 stars (533)4 out of 5 stars (961)4 out of 5 stars (3128)3 out of 5 stars (343)", "4 star": "15%", "Ultra Soft": "Ultra StrongSensitiveBasicFreshman", "1 star": "13%", "Withoutabox Submit to Film Festivals": "Woot! Deals and ShenanigansZappos Shoes & ClothingSouq.com Shop Online in the Middle EastSubscribe with Amazon Discover & try subscription services", "Amazon Music Stream millions of songs": "Amazon Drive Cloud storage from Amazon6pm Score deals on fashion brandsAbeBooks Books, art & collectiblesACX Audiobook Publishing Made EasyAlexa Actionable Analytics for the WebAmazon Business Everything For Your Business"}]