[{"Item model number": "K-3987-0", "Warranty Description": "One-year Limited Warranty", "Material": "Vitreous China", "International Shipping": "This item is not eligible for international shipping. Learn More", "5 star": "67%", "Item Dimensions": "—17.62 x 28.75 x 30.75 in—27.75 x 15 x 30 in15 x 27.75 x 29.5 in18 x 27.75 x 29.25 in", "1 star": "12%", "Amazon Music Stream millions of songs": "Amazon Drive Cloud storage from Amazon6pm Score deals on fashion brandsAbeBooks Books, art & collectiblesACX Audiobook Publishing Made EasyAlexa Actionable Analytics for the WebAmazon Business Everything For Your Business", "3 star": "9%", "Batteries Included?": "No", "California residents": "Click here for Proposition 65 warning", "ASIN": "B00CJW3G12", "Batteries Required?": "No", "Kindle Direct Publishing Indie Digital Publishing Made Easy": "Prime Now FREE 2-Hour Delivery on Everyday ItemsPrime Photos Unlimited Photo Storage Free With PrimeShopbop Designer Fashion BrandsTenMarks.com Math Activities for Kids & SchoolsAmazon Warehouse Great Deals on Quality Used ProductsWhole Foods Market America’s Healthiest Grocery Store", "2 star": "5%", "Best Sellers Rank": "#313,730 in Tools & Home Improvement ( See top 100 ) #137 in Tools & Home Improvement > Kitchen & Bath Fixtures > Bathroom Fixtures > Toilets & Toilet Parts > Toilets > Two-Piece Toilets", "Price": "From $210.70$340.33 $ 340 . 33$197.05 $ 197 . 05$236.55 $ 236 . 55$302.71 $ 302 . 71$199.99 $ 199 . 99", "AmazonFresh Groceries & More Right To Your Door": "AmazonGlobal Ship Orders InternationallyHome Services Handpicked Pros Happiness GuaranteeAmazon Inspire Digital Educational ResourcesAmazon Rapids Fun stories for kids on the goAmazon Restaurants Food delivery from local restaurantsAmazon Video Direct Video Distribution Made Easy", "Shape": "round", "Domestic Shipping": "Amazon only ships this item within the contiguous 48 United States. Other Sellers on Amazon may ship this item to Alaska, Hawaii and US Territories.", "Customer Reviews": "3.7 out of 5 stars 43 customer reviews 3.7 out of 5 stars", "Withoutabox Submit to Film Festivals": "Woot! Deals and ShenanigansZappos Shoes & ClothingSouq.com Shop Online in the Middle EastSubscribe with Amazon Discover & try subscription services", "Package Dimensions": "39 x 34.5 x 24.5 inches", "Item Package Quantity": "1", "Date First Available": "April 23, 2013", "Add to Cart": "Add to CartAdd to CartAdd to CartAdd to Cart", "Sold By": "Available from these sellerseFaucetseFaucetsSUPPLYdotcomBath1eFaucets", "Amazon Web Services Scalable Cloud Computing Services": "Audible Download Audio BooksAudiobookStand Discount Audiobooks on DiscBook Depository Books With Free Delivery WorldwideBox Office Mojo Find Movie Box Office DataComiXology Thousands of Digital ComicsCreateSpace Indie Print Publishing Made Easy", "Flush Type": "Gravity Flush Toilets", "Shipping": "—FREE ShippingFREE ShippingFREE ShippingFREE ShippingFREE Shipping", "Item Weight": "45 pounds", "Shipping Weight": "101 pounds", "Part Number": "K-3987-0", "This item KOHLER K-3987-0 Wellworth Two-Piece Round-Front Dual-Flush Toilet with Class Five Flush System and Left-Hand Trip Lever, White": "KOHLER K-3609-0 Cimarron Comfort Height Elongated 1.28 gpf Toilet with AquaPiston Technology, Less Seat, WhiteKohler K-3577-0 Wellworth Classic 1.28 gpf Round-Front Toilet with Class Five Flushing Technology and Left-Hand Trip Lever, WhiteAmerican Standard 2889218.020 H2Option Siphonic Dual Flush Normal Height Round Front Toilet, White, 2-PieceAmerican Standard 2889216.020 H2Option Siphonic Dual Flush Round Front Toilet, White, 2-PieceKohler K-3997-0 Wellworth Round-Front 1.28 gpf Toilet, White", "DPReview Digital Photography": "East Dane Designer Men's FashionFabric Sewing, Quilting & KnittingGoodreads Book reviews & recommendationsIMDb Movies, TV & CelebritiesIMDbPro Get Info Entertainment Professionals NeedJunglee.com Shop Online in India", "Certification": "Yes", "Color": "White", "Customer Rating": "3 out of 5 stars (43)4 out of 5 stars (118)4 out of 5 stars (29)4 out of 5 stars (67)4 out of 5 stars (254)0 out of 5 stars (0)", "4 star": "7%", "Size": "2-1/8\"", "Water Consumption": "1.6 GPF"}]