[{"Item model number": "FK110CP10NGR", "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More", "5 star": "86%", "AmazonFresh Groceries & More Right To Your Door": "AmazonGlobal Ship Orders InternationallyHome Services Handpicked Pros Happiness GuaranteeAmazon Inspire Digital Educational ResourcesAmazon Rapids Fun stories for kids on the goAmazon Restaurants Food delivery from local restaurantsAmazon Video Direct Video Distribution Made Easy", "1 star": "2%", "Amazon Music Stream millions of songs": "Amazon Drive Cloud storage from Amazon6pm Score deals on fashion brandsAbeBooks Books, art & collectiblesACX Audiobook Publishing Made EasyAlexa Actionable Analytics for the WebAmazon Business Everything For Your Business", "Amazon Web Services Scalable Cloud Computing Services": "Audible Download Audio BooksAudiobookStand Discount Audiobooks on DiscBook Depository Books With Free Delivery WorldwideBox Office Mojo Find Movie Box Office DataComiXology Thousands of Digital ComicsCreateSpace Indie Print Publishing Made Easy", "Shipping Weight": "5.6 ounces ( View shipping rates and policies )", "Item Weight": "5.6 ounces", "AmazonGlobal Shipping": "+$14.87", "Customer Reviews": "4.6 out of 5 stars 43 customer reviews 4.6 out of 5 stars", "ASIN": "B00C197CH2", "Kindle Direct Publishing Indie Digital Publishing Made Easy": "Prime Now FREE 2-Hour Delivery on Everyday ItemsPrime Photos Unlimited Photo Storage Free With PrimeShopbop Designer Fashion BrandsTenMarks.com Math Activities for Kids & SchoolsAmazon Warehouse Great Deals on Quality Used ProductsWhole Foods Market America’s Healthiest Grocery Store", "DPReview Digital Photography": "East Dane Designer Men's FashionFabric Sewing, Quilting & KnittingGoodreads Book reviews & recommendationsIMDb Movies, TV & CelebritiesIMDbPro Get Info Entertainment Professionals NeedJunglee.com Shop Online in India", "3 star 3 star (0%)": "0%", "2 star": "3%", "Best Sellers Rank": "#101,815 in Kitchen & Dining ( See Top 100 in Kitchen & Dining ) #15,504 in Tools & Home Improvement > Power & Hand Tools > Hand Tools", "Price": "$22.22", "Date first available at Amazon.com": "January 30, 2014", "Price:": "$22.22 + $14.87 Shipping & Import Fees Deposit to Italy Details Shipping & Fee Details Price $22.22 AmazonGlobal Shipping + $14.87 Estimated Import Fees Deposit + $0.00 Total $37.09 Learn more", "4 star": "9%", "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.", "Estimated Import Fees Deposit": "+$0.00", "Total": "$37.09", "Withoutabox Submit to Film Festivals": "Woot! Deals and ShenanigansZappos Shoes & ClothingSouq.com Shop Online in the Middle EastSubscribe with Amazon Discover & try subscription services", "Product Dimensions": "12 x 4 x 1 inches", "Manufacturer": "Kyocera Industrial Ceramics Corporation"}]