[{"Material Gauge": "18/8 Gauge", "Product Category": "Home and Kitchen", "Dimensions": "22.4 x 16.5 x 17.4 cm", "Weight": "4 kg", "Product Code": "31047455", "Material Grade": "304 Series", "Colour": "Silver", "Thickness": "2 mm", "Offers - FNS Madrid 24 Pc Cutlery Hanging Set Emi Offer : Buy this product on easy EMIs,starting at @ More Details>> Specifications - FNS Madrid 24 Pc Cutlery Hanging Set General Brand FNS Type Cutlery Set with Holder Product Details Colour Silver Body Material Stainless Steel Material Gauge 18/8 Gauge Material Grade 304 Series Thickness 2 mm Finish Hammer Finish On Handle No. of Cutlery Pieces 24 No. of Holders 1 Physical Measurements Dimensions 22.4 x 16.5 x 17.4 cm Weight 4 kg Additional Details Stain-proof Package Contents 6 Dinner Spoons 6 Dinner Forks 6 Tea Spoons 6 Dinner Knives 1 Hanging Stand Warranty 1 Year Manufacturing Warranty Special Note Every effort has been made to accurately reproduce the look of this product but there may be upto 5% variation in the colour and design of the actual product received due to varied screen resolution or lighting at time of digital photography. Accessories shown in the image are for the purpose of enhancement of the image only, and not for sale. Payment Options We accept payments made via debit cards, credit cards, EMI option from selected banks, cheques and internet banking. For further information on payment modes, please view payment options Replacement Policy Customers are requested to report any unfortunate in-transit breakage/damage within 48 hrs from the time of delivery by calling HS18 customer care on 0120-6189818 so that our team can ensure appropriate measures for replacement. Please read HomeShop18 Return Policy . Any such reporting after 48 hours does not fall under the Return Policy. However, in case of any manufacturing defect in the product, it will be covered under manufacturers warranty. Disclaimer Products sold on HomeShop18 are brand new and 100% genuine. Every effort has been made to ensure that the information on this site is accurate. If you find any error, please report here . Highlights - FNS Madrid 24 Pc Cutlery Hanging Set Product Code 31047455 Product Category Home and Kitchen Brand FNS Did we miss any relevant features for this product? Tell us what we missed . Would you like to or give feedback on images tell us about a lower price? FNS Madrid 24 Pc Cutlery Hanging Set Price: Rs. 2330.0": "recently sold in Home and Kitchen Frestol 1 L Plain Copper Bottle Rs. 2499 Rs. 499 (80% Off) Maxxlite Wireless HD IP Wifi CCTV Camera W... Rs. 5999 Rs. 2299 (62% Off) Klassic Vimal 36 Pc Stainless Steel Dinner... Rs. 3199 Rs. 1299 (59% Off) view more »", "Body Material": "Stainless Steel", "Finish": "Hammer Finish On Handle", "No. of Cutlery Pieces": "24", "No. of Holders": "1", "Type": "Cutlery Set with Holder", "Brand": "FNS"}]