[{"Product Category": "Home and Kitchen", "Benefits": "Contemporary minimalist design to suit your refined taste. Stainless steel is hygienic to use and easy to clean as compared to other materials. The serving bowl's can be used to serve gravy dishes or rice on to the dining table. The glasses can be used to serve raita, lassi, water, soft drinks etc. Perfect for all kitchen needs: The set comprises of components to serve 6 people comfortably. This set is perfect for gifting purposes at weddings, anniversaries. You get a magnificent dinner set at an extremely affordable price. An excellent choice if you are redoing your kitchen or want to replace your current dinner set with a trendy and contemporary one. An excellent choice if you are redoing your kitchen or want to replace your current Dinner Set as: This has a matching Serving Set Is made of mirror finish steel which gives a modern look to your kitchen It is unbreakable, rust-free & scratch-proof Contemporary minimalistic (simple) design to suit your taste and the elegant look to your home The Dessert Set and the Dinner Set are matching, which makes it a complete set and helps in making everything look well-coordinated.", "Dimensions": "Dinner plate: 26.5 cm (diameter) Quarter plate: 19 cm (diameter) Glasses Capacity: 300 ml Curry Bowls- Diameter -11.3 cm, 10 cm, 6.3 cm Serving Bowl set-1800 ml Storage Bowls - 600ml, 1000ml, 1350ml, 2000ml Sauce Pan-1500 ml Kadhai-2850 ml Mixing Bowl-2000 ml Medium Glass-290 ml", "Weight": "Net Weight: 17000 gms Gross Weight: 18400 gms", "overview - Kitchen in a Box - 131 pc from Everwel Ideally suited for anyone setting up a new home, this all-in-one kitchen set from Everwel consists of 131 pieces. Made of superior quality stainless steel, this extremely strong and durable set will not have dents or bend during normal use. The bowls that come with beading on the edges reduce the sharpness and prevents them from getting bent or shapeless. The beautifully designed spoons and forks will add grace to your dining experience. The unbreakable, rust-free and scratch-proof set, made of mirror finish steel is designed to suit your taste and grants a modern look to your kitchen. Perfect for all the kitchen needs, this set can serve 6 people comfortably. An apt gift for weddings or anniversaries and an excellent choice if you are redoing your kitchen. Offers - Kitchen in a Box - 131 pc from Everwel Freebie : - 3.5 Ltr Induction Base Pressure Cooker Worth Rs.1175 - American Crepe Ladies Suit ready to Stich Worth Rs.799 - 6 Pc Microwave Safe Mug Worth Rs.499 - Travel Bag worth Rs.699 - 4 Pc Polypropylene Fridge Bottle Worth Rs.295 - 3 Decker Tiffin Set Worth Rs.225 Emi Offer : Buy this product on easy EMIs,starting at @ More Details>> Specifications - Kitchen in a Box - 131 pc from Everwel General Brand Everwel Type Steel Dinner Set Steel Dinner Set Details Colour Silver No. of Pieces 131 Pcs Set Body Material Stainless Steel Details in Brief Superior quality: This set is made from high quality stainless steel making it exclusive and durable. Strong construction: This set is strong in construction and will not bend or have dents during normal use. Beading on the ends: Bowl's have beading on the edges reducing the sharpness & preventing it from getting bent or shapeless Food grade quality: The steel used in this set is of food grade quality making it safe to use. Elegant design: The spoons and forks have been beautifully designed to add grace to your dining experience. The set comprises of components to serve 6 people comfortably. Benefits Contemporary minimalist design to suit your refined taste. Stainless steel is hygienic to use and easy to clean as compared to other materials. The serving bowl's can be used to serve gravy dishes or rice on to the dining table. The glasses can be used to serve raita, lassi, water, soft drinks etc. Perfect for all kitchen needs: The set comprises of components to serve 6 people comfortably. This set is perfect for gifting purposes at weddings, anniversaries. You get a magnificent dinner set at an extremely affordable price. An excellent choice if you are redoing your kitchen or want to replace your current dinner set with a trendy and contemporary one. An excellent choice if you are redoing your kitchen or want to replace your current Dinner Set as: This has a matching Serving Set Is made of mirror finish steel which gives a modern look to your kitchen It is unbreakable, rust-free & scratch-proof Contemporary minimalistic (simple) design to suit your taste and the elegant look to your home The Dessert Set and the Dinner Set are matching, which makes it a complete set and helps in making everything look well-coordinated. Physical Measurements Dimensions Dinner plate: 26.5 cm (diameter) Quarter plate: 19 cm (diameter) Glasses Capacity: 300 ml Curry Bowls- Diameter -11.3 cm, 10 cm, 6.3 cm Serving Bowl set-1800 ml Storage Bowls - 600ml, 1000ml, 1350ml, 2000ml Sauce Pan-1500 ml Kadhai-2850 ml Mixing Bowl-2000 ml Medium Glass-290 ml Weight Net Weight: 17000 gms Gross Weight: 18400 gms Package Contents 6 Pc full plates 6 Pc half plates 6 Pc water glasses 6 Pc medium glasses 12 Pc curry bowls 6 Pc dessert bowls 6 Pc chutney bowls 3 Pc serving bowls 5 Pc serving spoons 6 Pc tea spoons 6 Pc dessert spoons 1 Pc colander 6 Pc ice cream cups 6 Pc ice cream spoons 6 Pc dinner forks 6 Ps fruit forks 1 Pc napkin holder 5 Pc german bowls set 1 Pc sauce pan 1 Pc kadhai 1 Pc fast pan 1 Pc mixing bowl 1 Pc Serving Spoon 1 Pc whisk 2 Pc salt & pepper dispensers 1 Pc rice tray 1 Pc rice spoon 1 Pc tea strainer 2 Pc Ladle 12 Pc mats & coasters 1 Pc knife 2 Pc butter knife 1 Pc peeler 1 Pc tong 1 Pc chapati tong 1 Pc skimmer - 3.5 Ltr Induction Base Pressure Cooker Worth Rs.1175 American Crepe Ladies Suit ready to Stich Worth Rs.799 Microwave safe 6 Pc Serving Set Worth Rs.999 Travel bag Worth Rs.699 6 Pc Microwave Safe Mug Worth Rs.499 Warranty Lifelong warranty against any manufacturing defect. Special Note Every effort has been made to accurately reproduce the look of this product but there may be upto 5% variation in the colour and design of the actual product received due to varied screen resolution or lighting at time of digital photography. Accessories shown in the image are for the purpose of enhancement of the image only, and not for sale. Payment Options We accept payments made via debit cards, credit cards, EMI option from selected banks, cheques and internet banking. For further information on payment modes, please view payment options Replacement Policy Customers are requested to report any unfortunate in-transit breakage/damage within 48 hrs from the time of delivery by calling HS18 customer care on 0120-4455918 so that our team can ensure appropriate measures for replacement. Please read HomeShop18 Return Policy . Any such reporting after 48 hours does not fall under the Return Policy. However, in case of any manufacturing defect in the product, it will be covered under manufacturers warranty. Disclaimer Products sold on HomeShop18 are brand new and 100% genuine. Every effort has been made to ensure that the information on this site is accurate. If you find any error, please report here. Highlights - Kitchen in a Box - 131 pc from Everwel Product Code 32928107 Product Category Home and Kitchen Brand Everwel Did we miss any relevant features for this product? Tell us what we missed . Would you like to or give feedback on images tell us about a lower price? Kitchen in a Box - 131 pc from Everwel Price: Rs. 6999.0": "recently sold in Home and Kitchen Frestol 1 L Plain Copper Bottle Rs. 2499 Rs. 499 (80% Off) Maxxlite Wireless HD IP Wifi CCTV Camera W... Rs. 5999 Rs. 2299 (62% Off) Klassic Vimal 36 Pc Stainless Steel Dinner... Rs. 3199 Rs. 1299 (59% Off) view more »", "No. of Pieces": "131 Pcs Set", "Brand": "Everwel", "Details in Brief": "Superior quality: This set is made from high quality stainless steel making it exclusive and durable. Strong construction: This set is strong in construction and will not bend or have dents during normal use. Beading on the ends: Bowl's have beading on the edges reducing the sharpness & preventing it from getting bent or shapeless Food grade quality: The steel used in this set is of food grade quality making it safe to use. Elegant design: The spoons and forks have been beautifully designed to add grace to your dining experience. The set comprises of components to serve 6 people comfortably.", "-": "3.5 Ltr Induction Base Pressure Cooker Worth Rs.1175 American Crepe Ladies Suit ready to Stich Worth Rs.799 Microwave safe 6 Pc Serving Set Worth Rs.999 Travel bag Worth Rs.699 6 Pc Microwave Safe Mug Worth Rs.499", "Product Code": "32928107", "Body Material": "Stainless Steel", "Freebie": ": - 3.5 Ltr Induction Base Pressure Cooker Worth Rs.1175", "Type": "Steel Dinner Set", "Colour": "Silver"}]